Tekla Open API Reference for Tekla Structures 2025
Polycurve Constructor (ICurve)
 Initializes a new instance of the Polycurve class from a curve geometry.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve(
	ICurve geometry
)
Public Sub New (
	geometry As ICurve
)
Parameters
geometry
Type: Tekla.Structures.Geometry3d.ICurve
Initial geometry for the polycurve
See Also
Reference
Polycurve Class
Polycurve Overload
Tekla.Structures.Geometry3d Namespace